Revit 2027 API
BuiltInFailures.RoofFailures.RoofSlopeExceedsThreshold Property
 Thickness of this Roof may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofSlopeExceedsThreshold { get; }
Public Shared ReadOnly Property RoofSlopeExceedsThreshold As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofSlopeExceedsThreshold {
	FailureDefinitionId^ get ();
}
static member RoofSlopeExceedsThreshold : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace